{
  "backend/main.mo": "Motoko backend with access control, user profiles, feed items, media uploads, and like toggling logic using list/map storage.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of short summaries describing major frontend files and their purposes.",
  "frontend/deploy/dfx-frontend-canister-assets.template.json": "Template showing correct dfx.json configuration for serving frontend/dist as canister assets and common deployment mistakes.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining how to correctly build and serve the Vite dist/ output for the frontend canister.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining light/dark modes and global styling.",
  "frontend/index.html": "Main HTML entrypoint with PWA metadata, icons, cache-prevention headers, and root mount for the app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, colors, scope, and display settings.",
  "frontend/public/sw.js": "Implements a service worker with versioned static/runtime caches, network-first and cache-first strategies, and exclusions for backend API calls.",
  "frontend/scripts/deploy-frontend-prod.sh": "Builds the frontend, verifies build and canister config, then deploys the frontend canister to production.",
  "frontend/scripts/verify-dist-shell.ts": "Validates Vite dist output by checking index.html, bundled assets, and required static files before deployment.",
  "frontend/scripts/verify-frontend-canister-assets-config.ts": "Checks dfx.json to ensure the frontend canister uses dist as its source, is type assets, and is correctly configured.",
  "frontend/src/App.tsx": "Main app component handling authentication state, service worker updates, PIN challenges, and conditional UI rendering.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout button logic using Internet Identity with cache clearing and error handling.",
  "frontend/src/components/auth/ProfileSetup.tsx": "UI form allowing new authenticated users to enter and save their display name profile.",
  "frontend/src/components/capture/VideoCapturePanel.tsx": "Handles camera access and recording, manages recording state, errors, and returns a captured video file.",
  "frontend/src/components/editor/MediaEditorDialog.tsx": "Provides UI for editing images or videos with filters, overlays, cropping, and trimming before exporting an edited file.",
  "frontend/src/components/feed/FeedItem.tsx": "Renders a feed media item with playback, mute, like, and speed-control logic tied to active state and user interactions.",
  "frontend/src/components/feed/FeedOverlay.tsx": "Displays handle, caption, and optional controls overlayed at the bottom of a feed item.",
  "frontend/src/components/feed/InteractionRail.tsx": "Shows like, comment, share, and download actions for a feed item with authentication checks and UI feedback.",
  "frontend/src/components/feed/SpeedControl.tsx": "Dropdown control allowing users to change video playback speed.",
  "frontend/src/components/feed/UploadButton.tsx": "Floating button that opens the upload dialog if the user is authenticated.",
  "frontend/src/components/feed/UploadDialog.tsx": "Manages uploading media with file validation, capture, editing, progress tracking, and caption input.",
  "frontend/src/components/feed/VideoFeed.tsx": "Scrollable video feed that tracks active item via IntersectionObserver and supports programmatic scrolling.",
  "frontend/src/components/feed/VideoFeedItem.tsx": "Stub file exporting nothing to avoid build errors; real implementation is in FeedItem.tsx.",
  "frontend/src/components/feed/VideoOverlayControls.tsx": "Renders play/pause and mute controls as overlay buttons on a video.",
  "frontend/src/components/search/SearchButton.tsx": "Button that opens the search dialog when clicked.",
  "frontend/src/components/search/SearchDialog.tsx": "Search modal with debounced queries, result listing, and identity check.",
  "frontend/src/components/security/PinChallengeDialog.tsx": "Dialog prompting the user for a PIN with attempt tracking and verification.",
  "frontend/src/components/security/SecurityButton.tsx": "Button that opens the security setup dialog.",
  "frontend/src/components/security/SecuritySetupDialog.tsx": "Two-step dialog for setting a PIN and security questions, saving via useSecuritySetup.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to identity, refetching dependent queries on change.",
  "frontend/src/hooks/useDeviceTrust.ts": "Manages a stored device ID and tracks whether the device is recognized or trusted.",
  "frontend/src/hooks/useDoubleTap.ts": "Hook that detects double-tap or double-click gestures and triggers a callback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching feed items, uploading media with progress, and optimistically toggling likes using the actor and identity.",
  "frontend/src/hooks/useSecuritySetup.ts": "Manages persistent user security setup (PIN and questions) in localStorage with save and verification helpers.",
  "frontend/src/index.css": "Tailwind base styles plus custom theme variables, layout rules, scrollbar hiding, safe-area padding, and mobile viewport fixes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/downloadMedia.ts": "Utility to fetch a media URL, convert it to a blob, and trigger a download via a temporary link.",
  "frontend/src/utils/mediaEdits.ts": "Includes browser-side image editing using canvas and placeholder video editing that returns the original file.",
  "frontend/src/utils/urlParams.ts": "Helpers for getting, persisting, and clearing URL parameters across query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings with custom CSS variables.",
  "frontend/vite.config.ts": "Vite setup with React, environment variable plugins, path alias, build options, dev server proxy, and dependency optimization settings.",
  "project_state.json": "Defines project state, goals, architectural notes, existing issues, and desired features for a TikTok‑style PWA with upload, search, security, settings, and distribution improvements. Lists known frontend build, routing, and media handling problems to fix."
}