{
  "backend/main.mo": "Motoko canister defining feed items, profiles, comments, likes, and media handling with access control and storage mixins.",
  "backend/migration.mo": "Migration module passing old actor state through unchanged to the new format with compatible type definitions.",
  "feature_evidence.json": "Feature evidence report mapping features to impacted frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of summarized descriptions for all frontend source files used in the project.",
  "frontend/deploy/dfx-frontend-canister-assets.template.json": "Template showing proper dfx.json configuration for serving built frontend assets and validating deployment.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining how to correctly build and serve the Vite frontend from the dist directory.",
  "frontend/index.css": "Global Tailwind-based theme definitions and dark-mode variables for the app’s UI.",
  "frontend/index.html": "Base HTML entry with PWA metadata, icons, and dev-time script reference to src/main.tsx.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app metadata, theme colors, and icons for installability.",
  "frontend/public/sw.js": "Service worker handling install, activate, and fetch events with cache versioning, static asset caching, and network-first or cache strategies while excluding backend calls.",
  "frontend/scripts/deploy-frontend-prod.sh": "Shell script that builds, verifies, and deploys the frontend to the Internet Computer, including post-deploy checks and output of the live canister URL.",
  "frontend/scripts/verify-dist-shell.ts": "Node script validating Vite build output by checking index.html references and required static files in dist before deployment.",
  "frontend/scripts/verify-frontend-canister-assets-config.ts": "Node script verifying dfx.json frontend canister configuration, ensuring it serves dist assets and is correctly typed and linked.",
  "frontend/src/App.tsx": "Main React app handling authentication state, service worker updates, PIN challenges, and routing to setup or feed UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity authentication state with loading UI and cache clearing.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Profile setup form allowing new users to submit their name via a mutation hook.",
  "frontend/src/components/capture/VideoCapturePanel.tsx": "Implements a video capture interface using MediaRecorder, handling camera setup, recording, errors, and returning the recorded file.",
  "frontend/src/components/comments/CommentComposer.tsx": "Provides a comment input with optional image/video upload, validation, upload progress, and submission via a mutation hook.",
  "frontend/src/components/comments/CommentList.tsx": "Renders threaded comments with likes, media attachments, reply handling, and deletion support.",
  "frontend/src/components/comments/CommentsSheet.tsx": "Displays a full-screen comments panel with sorting, loading states, and a composed list and composer for a feed item.",
  "frontend/src/components/editor/MediaEditorDialog.tsx": "Offers an editing dialog for images and videos supporting filters, text overlay, cropping, trimming, and applying edits before returning a new file.",
  "frontend/src/components/feed/FeedItem.tsx": "Displays a single feed post with video/image playback, like/comment/share actions, and state handling for interaction and visibility.",
  "frontend/src/components/feed/FeedOverlay.tsx": "Renders overlay UI for a feed item including handle, caption, social actions, and optional video controls.",
  "frontend/src/components/feed/InteractionRail.tsx": "Provides like, comment, share, and download buttons for a feed item with authentication checks and UI feedback.",
  "frontend/src/components/feed/PlayerSocialActions.tsx": "Offers follow and subscribe buttons with simple local state toggles and toast notifications.",
  "frontend/src/components/feed/SpeedControl.tsx": "Dropdown control allowing users to change video playback speed from preset options.",
  "frontend/src/components/feed/UploadButton.tsx": "Button that opens the upload dialog, gated by user authentication.",
  "frontend/src/components/feed/UploadDialog.tsx": "File upload dialog supporting image/video selection, validation, editing, capture, and progress-tracked uploads.",
  "frontend/src/components/feed/VideoFeed.tsx": "Scrollable feed that loads posts, manages active item detection, deep-link navigation, and error/loading states.",
  "frontend/src/components/feed/VideoFeedItem.tsx": "Placeholder file exporting nothing to avoid build issues.",
  "frontend/src/components/feed/VideoOverlayControls.tsx": "Play/pause and mute controls displayed over a video feed item.",
  "frontend/src/components/search/SearchButton.tsx": "Search button that opens the search dialog when clicked.",
  "frontend/src/components/search/SearchDialog.tsx": "Modal search UI with debounced text input, identity‑gated search, and interactive result selection.",
  "frontend/src/components/security/PinChallengeDialog.tsx": "PIN verification dialog that tracks attempts, triggers success callback, and locks out after failures.",
  "frontend/src/components/security/SecurityButton.tsx": "Button that opens the security setup dialog using a shield icon trigger.",
  "frontend/src/components/security/SecuritySetupDialog.tsx": "Multi‑step dialog for creating a PIN and two security questions, saving them via useSecuritySetup.",
  "frontend/src/components/share/ShareMenu.tsx": "Share dialog offering link copy and optional native share, with visual feedback on copy state.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useDeviceTrust.ts": "Manages a persistent device ID in localStorage and tracks whether a device is trusted.",
  "frontend/src/hooks/useDoubleTap.ts": "Hook detecting double‑tap or double‑click gestures and invoking a callback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login state, stored identities, and auth client setup.",
  "frontend/src/hooks/useInternetIdentityExternalBrowser.tsx": "Provides Internet Identity authentication context with support for external-browser login flows and state handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for feed fetching, media upload, and like toggling with optimistic updates and error handling.",
  "frontend/src/hooks/useSecuritySetup.ts": "Manages local PIN and security questions storage with verification and persistence.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, mobile-safe layout rules, and scroll/viewport behavior.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/downloadMedia.ts": "Fetches a URL as a blob and triggers a client-side file download.",
  "frontend/src/utils/embeddedBrowser.ts": "Detects embedded/in-app browser environments and determines if external redirects are supported.",
  "frontend/src/utils/iiExternalReturn.ts": "Handles external-browser Internet Identity login state, callback detection, nonce validation, and URL cleanup.",
  "frontend/src/utils/mediaEdits.ts": "Applies basic image edits via canvas and returns the edited file; video edits are stubbed to return the original file.",
  "frontend/src/utils/shareLinks.ts": "Generates shareable post URLs and provides clipboard and native share utility functions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store and fetch them from sessionStorage, and sync URL params to session storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugin integrations.",
  "frontend/vite.config.ts": "Sets up Vite with React, environment variable plugins, path aliases, build options, and a dev proxy for API requests.",
  "project_state.json": "Defines the project's current state, listing implemented TikTok-style comment features and pending feature requests."
}