{
  "backend/main.mo": "Motoko actor implementing media feed, profiles, likes, and comments with access-control and blob storage mixins.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files.",
  "frontend/deploy/dfx-frontend-canister-assets.template.json": "Template showing required dfx.json settings for serving dist/ as frontend assets.",
  "frontend/DEPLOYMENT.md": "Guide explaining correct Vite production build deployment for the frontend canister.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme variables and global styling rules.",
  "frontend/index.html": "HTML entry point with PWA metadata and root mount; still loads src/main.tsx for dev.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, colors, and icons.",
  "frontend/public/sw.js": "Service worker handling cache versioning, static asset caching, network-first HTML, and offline fallback.",
  "frontend/scripts/deploy-frontend-prod.sh": "Automated script to build, verify, and deploy the frontend canister to the Internet Computer.",
  "frontend/scripts/verify-dist-shell.ts": "Checks dist output for required files and correct Vite bundling, failing if references or assets are missing.",
  "frontend/scripts/verify-frontend-canister-assets-config.ts": "Validates dfx.json frontend canister is type assets, uses dist as source, and depends on backend.",
  "frontend/src/App.tsx": "Main app component handling identity, profile setup, service worker updates, and PIN-gated actions.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity auth flow and query cache clearing.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Simple form for saving a new user’s display name via profile mutation.",
  "frontend/src/components/capture/VideoCapturePanel.tsx": "Provides camera recording UI with start/stop, playback, error handling, and video submission.",
  "frontend/src/components/comments/CommentComposer.tsx": "Comment form supporting text, optional image/video upload, validation, and mutation submission.",
  "frontend/src/components/comments/CommentList.tsx": "Renders a list of comments with avatars, text, and optional image or video attachments.",
  "frontend/src/components/comments/CommentsSheet.tsx": "Displays comments in a bottom sheet with loading states and a composer for adding new comments.",
  "frontend/src/components/editor/MediaEditorDialog.tsx": "Provides a dialog for editing images or videos with filters, text overlays, cropping, and trimming.",
  "frontend/src/components/feed/FeedItem.tsx": "Represents a single feed item with media playback, interactions, liking, comments, and sharing controls.",
  "frontend/src/components/feed/FeedOverlay.tsx": "Shows handle and caption overlay on feed items with optional child controls when active.",
  "frontend/src/components/feed/InteractionRail.tsx": "Displays like, comment, share, and download buttons with counts and authentication checks.",
  "frontend/src/components/feed/SpeedControl.tsx": "Dropdown control for adjusting video playback speed.",
  "frontend/src/components/feed/UploadButton.tsx": "Upload trigger button that opens the upload dialog if the user is authenticated.",
  "frontend/src/components/feed/UploadDialog.tsx": "Manages media upload flow with file validation, capture, editing, and progress handling. Uses dialogs and mutations to upload images or videos with captions.",
  "frontend/src/components/feed/VideoFeed.tsx": "Displays a scrollable video feed with intersection-based active item detection and deep-link navigation. Handles loading, errors, and smooth scrolling to specific posts.",
  "frontend/src/components/feed/VideoFeedItem.tsx": "Placeholder file exporting nothing to avoid build errors; FeedItem.tsx is used instead.",
  "frontend/src/components/feed/VideoOverlayControls.tsx": "Provides play/pause and mute UI controls overlayed on videos.",
  "frontend/src/components/search/SearchButton.tsx": "Renders a search icon button that opens the SearchDialog.",
  "frontend/src/components/search/SearchDialog.tsx": "Dialog for searching feed items with debounced input, authenticated search requests, and result listing.",
  "frontend/src/components/security/PinChallengeDialog.tsx": "Prompts users to enter a PIN for security verification, tracking attempts and triggering success or lockout.",
  "frontend/src/components/security/SecurityButton.tsx": "Button that opens the SecuritySetupDialog for configuring security settings.",
  "frontend/src/components/security/SecuritySetupDialog.tsx": "Guides users through creating a PIN and security questions, saving the setup when complete.",
  "frontend/src/components/share/ShareMenu.tsx": "Share dialog allowing users to copy a post link or use native sharing when supported.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useDeviceTrust.ts": "Manages a persistent device ID and tracks whether the device is known, with helpers to clear or trust the device.",
  "frontend/src/hooks/useDoubleTap.ts": "Provides a ref that detects double‑tap or double‑click events and triggers a callback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, managing login/logout, and exposing status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks for fetching feed items, uploading media, and toggling likes using the backend actor and React Query.",
  "frontend/src/hooks/useSecuritySetup.ts": "Stores and retrieves a PIN and security questions in localStorage and provides validation helpers.",
  "frontend/src/index.css": "Tailwind-based global styles defining themes, layout resets, scroll behavior, and mobile-safe viewport handling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/utils/downloadMedia.ts": "Fetches a media file and triggers a browser download using a temporary object URL.",
  "frontend/src/utils/mediaEdits.ts": "Applies simple canvas edits to images and returns a new file; video edits are stubbed and return the original file.",
  "frontend/src/utils/shareLinks.ts": "Generates share URLs, copies text to clipboard, checks native share support, and invokes native sharing when available.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, remove, and persist URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Defines Tailwind setup with custom colors, typography, container settings, animations, and extended theme utilities.",
  "frontend/vite.config.ts": "Configures Vite for React with environment variable support, path aliases, build settings, and a dev proxy.",
  "project_state.json": "Describes the project’s state, goals, architecture, known issues, and existing features for a TikTok-style web app."
}