{
  "backend/main.mo": "Motoko backend actor managing feed items, user profiles, media uploads, likes, and comments with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Aggregated short descriptions of all frontend component files for quick reference.",
  "frontend/deploy/dfx-frontend-canister-assets.template.json": "Configuration template showing how to correctly point the frontend canister to the Vite dist directory with validation steps.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining required Vite production build workflow and correct frontend canister configuration.",
  "frontend/index.css": "Global Tailwind styles defining OKLCH theme variables, dark mode values, and base element styling.",
  "frontend/index.html": "HTML entry point with PWA metadata, icons, and script loading the main React entry file.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, display settings, icons, and categories.",
  "frontend/public/sw.js": "Implements a service worker that caches static assets, cleans old caches, bypasses API traffic, and uses network-first or cache-first strategies with an offline fallback.",
  "frontend/scripts/deploy-frontend-prod.sh": "Builds the frontend, verifies the build and canister config, then deploys the frontend canister to the Internet Computer with post-deploy checks.",
  "frontend/scripts/verify-dist-shell.ts": "Validates the Vite dist output by checking index.html references and required static assets, failing if the build is incomplete or misconfigured.",
  "frontend/scripts/verify-frontend-canister-assets-config.ts": "Checks dfx.json to ensure the frontend canister is an assets canister using the dist folder and with correct dependencies.",
  "frontend/src/App.tsx": "Main app component handling authentication state, profile setup flow, service worker updates, and global PIN challenge interactions.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout UI tied to Internet Identity with status handling and cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Displays a form for new authenticated users to save their profile name before entering the app.",
  "frontend/src/components/capture/VideoCapturePanel.tsx": "Provides camera access and recording controls for capturing a WebM video, handling permissions, errors, and returning the recorded file.",
  "frontend/src/components/comments/CommentComposer.tsx": "A comment input form supporting text, image/video attachments, upload progress, and submission via a mutation.",
  "frontend/src/components/comments/CommentList.tsx": "Renders a list of comments with author info, text, and optional image or video attachments.",
  "frontend/src/components/comments/CommentsSheet.tsx": "Bottom sheet that loads, displays, and updates comments for a feed item with a composer at the bottom.",
  "frontend/src/components/editor/MediaEditorDialog.tsx": "Dialog for editing images or videos with filters, text, cropping, and trimming before returning an edited file.",
  "frontend/src/components/feed/FeedItem.tsx": "Displays a feed item with media playback, like interactions, comments sheet, and share options, managing video state and user actions.",
  "frontend/src/components/feed/FeedOverlay.tsx": "Overlay showing handle and caption over media with optional child controls when active.",
  "frontend/src/components/feed/InteractionRail.tsx": "Renders like, comment, share, and download buttons with authentication checks and media download handling.",
  "frontend/src/components/feed/SpeedControl.tsx": "Provides a dropdown to change video playback speed using preset options.",
  "frontend/src/components/feed/UploadButton.tsx": "Shows an upload button that opens the upload dialog if the user is authenticated.",
  "frontend/src/components/feed/UploadDialog.tsx": "Handles media selection, capture, editing, and uploading with validation, progress tracking, and error handling.",
  "frontend/src/components/feed/VideoFeed.tsx": "Displays a scrollable feed of posts with intersection-based active item tracking and deep link navigation.",
  "frontend/src/components/feed/VideoFeedItem.tsx": "Placeholder file exporting nothing to avoid build errors.",
  "frontend/src/components/feed/VideoOverlayControls.tsx": "Overlay controls for play/pause and mute toggling on videos.",
  "frontend/src/components/search/SearchButton.tsx": "Button that opens the search dialog.",
  "frontend/src/components/search/SearchDialog.tsx": "Search dialog that debounces input, fetches results, and displays matching feed items.",
  "frontend/src/components/security/PinChallengeDialog.tsx": "PIN verification dialog with attempt tracking and success/failure handling.",
  "frontend/src/components/security/SecurityButton.tsx": "Button that opens the security setup dialog.",
  "frontend/src/components/security/SecuritySetupDialog.tsx": "Modal for creating a PIN and security questions, validating inputs and saving setup via useSecuritySetup.",
  "frontend/src/components/share/ShareMenu.tsx": "Dialog offering link copy and native share options with visual feedback.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDeviceTrust.ts": "Manages a persistent device ID in localStorage and tracks whether the device is trusted.",
  "frontend/src/hooks/useDoubleTap.ts": "Provides a ref that detects touch or mouse double‑tap events and triggers a callback.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and provider for Internet Identity login, identity persistence, and status handling.",
  "frontend/src/hooks/useInternetIdentityExternalBrowser.tsx": "Extended Internet Identity provider supporting external‑browser login flows and related state management.",
  "frontend/src/hooks/useQueries.ts": "React‑query hooks for feed loading, media upload, and like toggling with optimistic updates and error handling.",
  "frontend/src/hooks/useSecuritySetup.ts": "React hook managing PIN and security questions stored in localStorage with save and verify helpers.",
  "frontend/src/index.css": "Tailwind base styles plus custom color variables, layout resets, and mobile/PWA-safe utilities.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity provider before rendering App.",
  "frontend/src/utils/downloadMedia.ts": "Downloads a media file via fetch, creates a blob URL, and triggers a hidden link download.",
  "frontend/src/utils/embeddedBrowser.ts": "Detects embedded/in-app browsers and checks support for external redirects.",
  "frontend/src/utils/iiExternalReturn.ts": "Manages external Internet Identity login state, nonce validation, callback detection, and URL cleanup.",
  "frontend/src/utils/mediaEdits.ts": "Applies basic image edits using canvas and returns the edited file; video edits are stubbed and return original.",
  "frontend/src/utils/shareLinks.ts": "Generates share URLs, provides clipboard and native share helpers, and checks share API support.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, removing, and persisting URL params across query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, radii, shadows, and keyframes with custom CSS variables.",
  "frontend/vite.config.ts": "Vite config enabling React, env injection, path aliasing, build options, and API proxy setup.",
  "project_state.json": "Tracks project ZIZO’s state, describing the Android Internet Identity login workaround, known WebView limitations, existing features, and a pending feature request for external-browser authentication."
}