{
  "backend/main.mo": "Main canister logic handling user profiles, media feed items, likes, and access control with migration and blob storage mixins.",
  "backend/migration.mo": "Defines old/new feed structures and a migration function mapping old actor state to the new media-based format.",
  "feature_evidence.json": "Feature evidence report mapping high-level features to related frontend files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file involved in feed, upload, auth, and PWA features.",
  "frontend/index.css": "Global Tailwind-based styles defining color variables, dark mode, layout utilities, and safe-area handling.",
  "frontend/index.html": "HTML entry point with PWA metadata, manifest and icons, and root app mounting point.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, icons, theme colors, categories, and display mode.",
  "frontend/public/sw.js": "Service worker implementing caching of static assets, cache cleanup, and network-first fetch handling with offline fallback.",
  "frontend/src/App.tsx": "Main React app component managing auth state, profile setup, PWA service worker registration, and rendering the feed UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with query cache clearing and loading states.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Form for setting a user's display name and saving it via mutation.",
  "frontend/src/components/feed/FeedItem.tsx": "Renders a single feed item with video/image playback, like handling, double‑tap detection, and overlays.",
  "frontend/src/components/feed/FeedOverlay.tsx": "Displays handle, caption, and optional controls overlaid at the bottom of a feed item.",
  "frontend/src/components/feed/InteractionRail.tsx": "Provides like, comment, and share buttons with counts and auth checks.",
  "frontend/src/components/feed/SpeedControl.tsx": "Dropdown control for adjusting video playback speed.",
  "frontend/src/components/feed/UploadButton.tsx": "Upload trigger that checks authentication and opens the upload dialog.",
  "frontend/src/components/feed/UploadDialog.tsx": "Dialog for selecting media, entering a caption, validating, and uploading with progress tracking.",
  "frontend/src/components/feed/VideoFeed.tsx": "Scrollable vertical feed that loads items and tracks which item is active via IntersectionObserver.",
  "frontend/src/components/feed/VideoFeedItem.tsx": "Empty placeholder file.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useDoubleTap.ts": "Hook that detects double‑tap or double‑click gestures and triggers a callback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication via AuthClient, exposing identity, login, logout, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching feed items, uploading media with progress, and toggling likes with optimistic updates.",
  "frontend/src/index.css": "Global Tailwind-based styles defining theme variables, dark mode, layout resets, mobile-safe viewport behavior, and scrollbar/safe-area utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting App inside QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors tied to CSS variables, container settings, extended utilities, and plugins.",
  "project_state.json": "Project metadata describing goals, architecture notes, features, and assets for a TikTok-style feed with user uploads."
}