{
  "backend/main.mo": "Motoko canister implementing user profiles, media feed CRUD, like toggling, and access‑controlled operations via authorization and blob‑storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for quick reference during build planning.",
  "frontend/index.css": "Tailwind base and theme definitions using OKLCH variables with dark/light modes and global styling utilities.",
  "frontend/index.html": "PWA entry HTML with manifest, icons, viewport settings, and root app mount.",
  "frontend/public/manifest.webmanifest": "PWA manifest describing app metadata, icons, colors, orientation, and categories.",
  "frontend/public/sw.js": "Service worker providing static asset caching, network-first fetch handling, offline fallback, and cache versioning.",
  "frontend/src/App.tsx": "Main React app managing authentication, profile gating, feed display, upload/search buttons, PIN challenge, and service worker registration.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button wired to Internet Identity with cache clearing and error handling.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Renders a profile setup form that saves the user's name using a mutation hook.",
  "frontend/src/components/capture/VideoCapturePanel.tsx": "No summary available.",
  "frontend/src/components/editor/MediaEditorDialog.tsx": "Provides a dialog for editing images or videos with filters, text, cropping, and trimming before outputting an edited file.",
  "frontend/src/components/feed/FeedItem.tsx": "Displays a feed item with auto-play video, like interactions, overlays, and speed controls when active.",
  "frontend/src/components/feed/FeedOverlay.tsx": "Shows handle, caption, and optional controls in a bottom gradient overlay on feed items.",
  "frontend/src/components/feed/InteractionRail.tsx": "Offers like, comment, share, and download actions for a feed item, handling authentication and UI feedback.",
  "frontend/src/components/feed/SpeedControl.tsx": "Dropdown control allowing users to change video playback speed.",
  "frontend/src/components/feed/UploadButton.tsx": "Button that opens the upload dialog if the user is authenticated, otherwise prompts login.",
  "frontend/src/components/feed/UploadDialog.tsx": "Dialog for uploading images or videos with caption, capture/edit options, and progress handling.",
  "frontend/src/components/feed/VideoFeed.tsx": "Scrollable feed that loads items, tracks active item via intersection observer, and supports external scroll-to-item control.",
  "frontend/src/components/feed/VideoFeedItem.tsx": "Empty file placeholder for an individual feed item component.",
  "frontend/src/components/search/SearchButton.tsx": "Button that opens the search dialog.",
  "frontend/src/components/search/SearchDialog.tsx": "Dialog for searching feed items with debounced input, result listing, and identity check.",
  "frontend/src/components/security/PinChallengeDialog.tsx": "PIN verification dialog enforcing attempts and triggering success or lockout behavior.",
  "frontend/src/components/security/SecurityButton.tsx": "Opens the security setup dialog from a button.",
  "frontend/src/components/security/SecuritySetupDialog.tsx": "Multi-step setup dialog for configuring PIN and security questions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages backend actor instances tied to identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useDeviceTrust.ts": "Manages per-device ID and trust state using localStorage.",
  "frontend/src/hooks/useDoubleTap.ts": "Provides a hook that detects double-tap or double-click events and triggers a callback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context using Internet Identity, handling login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching feed items, uploading media, and toggling likes with optimistic updates.",
  "frontend/src/hooks/useSecuritySetup.ts": "Manages PIN and security questions in localStorage and provides verification helpers.",
  "frontend/src/index.css": "Configures Tailwind styles, theme variables, layout rules, and mobile/PWA-specific behaviors.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers and loads global styles.",
  "frontend/src/utils/downloadMedia.ts": "Downloads a media file from a URL by creating a temporary link and triggering a browser download.",
  "frontend/src/utils/mediaEdits.ts": "Applies simple image and video edits using canvas and returns edited files.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project’s feature set, issues, and architectural notes for a TikTok-style web app, including feed behavior, search, media tools, security flows, and known upload/feed bugs."
}