{
  "kind": "build_request",
  "title": "Retry build + fix upload caption optional, restore uploaded video audio, prevent freezing, add pause/resume controls",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-33",
      "text": "Make the upload caption optional (uploader may leave it empty) while keeping the upload flow functional for both images and videos.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Can you make the caption when uploading videos optional",
          "For the caption side make it a decision to the uploader"
        ]
      },
      "acceptanceCriteria": [
        "The Upload button is enabled when a media file is selected even if the caption field is empty/whitespace.",
        "Submitting an upload with an empty caption succeeds and creates a feed item.",
        "User-facing validation/error text no longer says a caption is required."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Update the backend addMedia API behavior to accept empty captions (store empty string) so optional captions do not cause backend errors or traps.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make the caption when uploading videos optional"
        ]
      },
      "acceptanceCriteria": [
        "Calling addMedia with caption=\"\" succeeds for authenticated users.",
        "Feed items returned from fetchFeedItems can contain caption=\"\" without breaking serialization or UI rendering."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Fix the media editing pipeline so video edits do not convert the uploaded video into a JPEG/image and do not strip audio; edited videos must remain valid playable video files.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "There is simply no audio track at all",
          "some videos aren't able to play after uploaded",
          "For the video that freeze It happened when every video is uploaded"
        ]
      },
      "acceptanceCriteria": [
        "Using the in-app editor on a video and then uploading results in a feed item that plays as video (not an image) in the feed.",
        "Uploaded videos retain their original audio track (audio is present when unmuted).",
        "Uploaded videos play through to the end and can be replayed without freezing part-way."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Add an in-feed pause/resume control on the video overlay so users can manually pause and resume the currently active video.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add a pause and resume button"
        ]
      },
      "acceptanceCriteria": [
        "When a feed item is a video and is active, a visible Pause/Play control is available on the overlay.",
        "Tapping Pause pauses the active video; tapping Play resumes playback from the current time.",
        "The control does not appear (or is disabled) for image posts."
      ]
    },
    {
      "id": "REQ-37",
      "text": "Ensure uploaded videos can play with sound (not permanently silent): provide a user-facing unmute/mute control for the active video and ensure the video element can output audio when unmuted.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "There is simply no audio track at all"
        ]
      },
      "acceptanceCriteria": [
        "Active videos start muted by default, but the user can toggle unmute and hear audio for videos that contain audio.",
        "The mute state change takes effect immediately on the active video element.",
        "The mute/unmute control is accessible in the in-feed overlay UI."
      ]
    },
    {
      "id": "REQ-38",
      "text": "Re-run the full build and deployment so the updated frontend and backend are compiled and the deployed app reflects the fixes.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Build again now"
        ]
      },
      "acceptanceCriteria": [
        "Frontend and backend compile successfully with no build-blocking errors.",
        "The deployed app loads and the upload + playback fixes are available in production."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add a migration (backend/migration.mo) if a stable state upgrade is required.",
    "Do not edit files under frontend/src/components/ui or other paths listed in frontend.immutablePaths.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing server-side transcoding or format conversion for uploaded videos.",
    "Adding third-party media processing services or external storage/database.",
    "Changing authentication providers (Internet Identity remains the only auth)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}