{
  "kind": "build_request",
  "title": "Fix empty feed + upload feedback, add search, in-app capture/editing, security verification, and media download",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-13",
      "text": "Fix the feed sometimes rendering as completely empty by making feed loading resilient and diagnosable: ensure the app always attempts to fetch `fetchFeedItems()` when an actor is available (anonymous or authenticated), and surface actionable error details (without exposing sensitive data) when the fetch fails.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "the feet does not shows older post it is completely"
        ]
      },
      "acceptanceCriteria": [
        "When the backend returns at least 1 feed item, the feed UI renders it (not the empty-state screen).",
        "If `fetchFeedItems()` throws, the UI shows the existing error screen and includes a clear retry action (e.g., button) that re-runs the query.",
        "If the actor is not yet available, the UI shows a loading state rather than a permanent empty-state."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Improve upload UX so users always receive clear progress + completion feedback and their new post becomes visible immediately after upload succeeds.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "After uploading I don't see my post,",
          "The app that not show any success message or spinner finishing"
        ]
      },
      "acceptanceCriteria": [
        "While uploading, the Upload dialog displays progress feedback (existing progress bar) and a clear busy state (disable inputs/buttons).",
        "On successful upload, the app shows a visible success confirmation (toast is already used) and the new item appears in the feed without requiring a manual refresh.",
        "On upload failure, the UI shows an error message and leaves the dialog open so the user can retry."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Add keyword search for both videos and images across captions and creator handles, accessible via a Search button in the main top bar.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "add a search button, for the user to search for any video or picture here she wants.",
          "The search button should search through captions, creator handles and both videos and pictures by keyboard."
        ]
      },
      "acceptanceCriteria": [
        "A Search button is visible on both mobile and desktop in the main UI header.",
        "Search supports matching against both `caption` and `handle` and returns both image and video posts.",
        "Search results are shown in a dedicated UI (modal/screen) and selecting a result navigates the user to that post in the vertical feed.",
        "Backend exposes a query method to search server-side (so search is not limited to already-loaded client items)."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Add in-app capture for live video recording directly inside the app using the device camera, integrated into the existing upload flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "It show always record directly inside the app using the device camera."
        ]
      },
      "acceptanceCriteria": [
        "From the upload entry point, the user can choose to record a video using their camera (in-app) and then proceed to caption + upload.",
        "Recorded video can be previewed before upload.",
        "If camera/microphone permission is denied, the UI shows a clear explanation and allows the user to fall back to file upload."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Add basic editing tools for images and videos: image cropping, video trimming, text overlays, and simple filters, applied before upload.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Editing tools search as cropping, trimming videos, add text,filters."
        ]
      },
      "acceptanceCriteria": [
        "After selecting an image, the user can crop it and apply at least one simple filter before upload.",
        "After selecting/recording a video, the user can trim the start/end and apply at least one simple filter before upload.",
        "User can add a text overlay to both images and videos before upload (positioning can be basic).",
        "Edits are reflected in the media that is uploaded (not just a preview)."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Implement a simplified in-app three-step security verification (without email): security questions, device confirmation, and a PIN challenge that is triggered when the system detects suspicious activity.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Let's ignore the email verification .",
          "For Three steps verification it should include email code, security questions and device confirmation.",
          "Requesting for user pin anytime the system feels something suspicious."
        ]
      },
      "acceptanceCriteria": [
        "The app provides a setup flow for authenticated users to configure: (1) security questions/answers and (2) a PIN.",
        "The backend stores verification setup per user and can require verification for sensitive actions.",
        "Device confirmation is implemented as a per-device trust mechanism (a device identifier stored client-side and registered with the backend); new/untrusted devices must be confirmed.",
        "When suspicious activity is detected, the user is prompted for their PIN and cannot proceed until the PIN is verified.",
        "Email verification is not present anywhere in the UI or backend logic."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add the ability for users to download media (images/videos) from the feed directly to their device local storage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Downloading orders upload and saving it straight to your device"
        ]
      },
      "acceptanceCriteria": [
        "Each feed item provides a visible Download action.",
        "Tapping Download saves the currently viewed image/video to the user’s device (using browser download behavior).",
        "Download works for both image and video items using the existing direct media URLs (`getDirectURL()`)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo (no additional backend services).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "No email sending/SMTP/third-party messaging integrations; the verification flow must not rely on email codes.",
    "User-facing text must be in English."
  ],
  "nonGoals": [
    "Implementing real-time chat, comments, or share functionality beyond existing placeholders.",
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Storing a private in-app gallery of downloaded media on the backend (downloads are to the user’s device only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}