{
  "kind": "build_request",
  "title": "Rebuild and redeploy to regenerate a working ICP public URL (icp0.io)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-46",
      "text": "Rebuild and redeploy both backend and frontend so the production deployment generates a working public ICP URL and the app loads successfully from the frontend canister.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Regenerate the ICP public app URL",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "A fresh deployment completes successfully for both backend and frontend.",
        "The deployed app loads in a browser from the frontend canister without showing a blank page, a raw link page, or “Canister ID Not Resolved”."
      ]
    },
    {
      "id": "REQ-47",
      "text": "Fix the frontend production asset serving so the deployed frontend canister serves the Vite production build output (frontend/dist) instead of source files, ensuring the deployed app shell does not reference the development entrypoint /src/main.tsx.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Regenerate the ICP public app URL"
        ]
      },
      "acceptanceCriteria": [
        "Production deployment serves dist/index.html and dist/assets/* and does not serve or reference /src/main.tsx.",
        "Opening the deployed icp0 URL shows the React app UI and loads bundled JS/CSS from /assets/* with HTTP 200 responses."
      ]
    },
    {
      "id": "REQ-48",
      "text": "Make the deploy fail fast when the frontend build output is not production-ready by running the existing frontend verification scripts as a required gate before deploying the frontend canister.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Regenerate the ICP public app URL"
        ]
      },
      "acceptanceCriteria": [
        "The production deploy flow runs the equivalent of frontend/scripts/verify-dist-shell.ts and frontend/scripts/verify-frontend-canister-assets-config.ts before deploying the frontend canister.",
        "If dist/index.html references /src/main.tsx or required dist static files are missing, the deploy fails with a clear error message and does not proceed to deploy the broken frontend."
      ]
    },
    {
      "id": "REQ-49",
      "text": "After the successful rebuild and redeploy, provide the working public app URL in the exact format https://<your-frontend-canister-id>.icp0.io.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Regenerate the ICP public app URL"
        ]
      },
      "acceptanceCriteria": [
        "The final output includes a single, concrete icp0 URL in the format https://<frontend-canister-id>.icp0.io (not a caffeine.xyz preview URL)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if an upgrade requires state migration.",
    "Do not edit any files under frontend/src/components/ui or any other frontend immutablePaths (compose them instead).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new feed/product features unrelated to deployment or public URL regeneration.",
    "Using external cloud hosting or non-Internet-Computer deployment targets.",
    "Replacing Internet Identity authentication with third-party authentication providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}