{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix ICP frontend canister production asset serving and deployment gating",
  "requirements": [
    {
      "id": "REQ-46",
      "summary": "Ensure the production redeploy flow rebuilds and redeploys in an order that results in a working icp0 URL and a loadable frontend canister app.",
      "acceptanceCriteria": [
        "A fresh deployment completes successfully for both backend and frontend.",
        "The deployed app loads in a browser from the frontend canister without showing a blank page, a raw link page, or “Canister ID Not Resolved”."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/deploy-frontend-prod.sh",
          "operation": "modify",
          "description": "Update the production deploy script to redeploy the full app (deploy backend first, then frontend) from a single flow, while keeping the existing build + verification gates before the frontend canister deploy; ensure the script surfaces clear failures and outputs the final icp0 URL upon success."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Expand deployment documentation to explicitly describe the correct production redeploy sequence (backend then frontend) and how to confirm the frontend canister serves the production bundle (no /src/main.tsx, assets load from dist)."
        }
      ]
    },
    {
      "id": "REQ-47",
      "summary": "Fix production asset serving so the deployed frontend canister serves the Vite production build output from dist rather than source files.",
      "acceptanceCriteria": [
        "Production deployment serves dist/index.html and dist/assets/* and does not serve or reference /src/main.tsx.",
        "Opening the deployed icp0 URL shows the React app UI and loads bundled JS/CSS from /assets/* with HTTP 200 responses."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/verify-dist-shell.ts",
          "operation": "modify",
          "description": "Strengthen dist shell verification to more strictly validate that dist/index.html references only bundled /assets/* outputs and does not reference /src/main.tsx, and improve failure messages to clearly indicate that serving source files indicates a misconfigured frontend assets canister."
        },
        {
          "path": "frontend/scripts/verify-frontend-canister-assets-config.ts",
          "operation": "modify",
          "description": "Tighten frontend canister asset configuration checks to hard-fail on any configuration that could cause source-file serving (e.g., missing dist source, presence of src in sources), and emit explicit remediation instructions referencing the required assets-canister dist configuration."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Document the expected production behavior (dist/index.html served; bundled JS/CSS under /assets/*) and add a troubleshooting section for the specific failure mode where the deployed shell references /src/main.tsx."
        }
      ]
    },
    {
      "id": "REQ-48",
      "summary": "Make deploy fail fast by enforcing existing frontend verification scripts as a required gate before deploying the frontend canister.",
      "acceptanceCriteria": [
        "The production deploy flow runs the equivalent of frontend/scripts/verify-dist-shell.ts and frontend/scripts/verify-frontend-canister-assets-config.ts before deploying the frontend canister.",
        "If dist/index.html references /src/main.tsx or required dist static files are missing, the deploy fails with a clear error message and does not proceed to deploy the broken frontend."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/deploy-frontend-prod.sh",
          "operation": "modify",
          "description": "Harden the deploy script to be an explicit gate (strict shell options, clear phase banners, and guaranteed non-zero exit on verification failure) so it never proceeds to deploy the frontend canister when verification fails."
        },
        {
          "path": "frontend/scripts/verify-dist-shell.ts",
          "operation": "modify",
          "description": "Ensure verification failures are concise and actionable (explicitly call out /src/main.tsx references and missing required dist assets) so the deploy gate error is clear."
        },
        {
          "path": "frontend/scripts/verify-frontend-canister-assets-config.ts",
          "operation": "modify",
          "description": "Ensure the canister-assets configuration verification clearly reports which dfx.json fields are invalid for production asset serving and exits non-zero to stop deployment."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Provide a reliable way to output the working icp0 public app URL after redeploy in the exact required format.",
      "acceptanceCriteria": [
        "The final output includes a single, concrete icp0 URL in the format https://<frontend-canister-id>.icp0.io (not a caffeine.xyz preview URL)."
      ],
      "file_operations": [
        {
          "path": "frontend/scripts/deploy-frontend-prod.sh",
          "operation": "modify",
          "description": "Adjust the successful deploy output to print a single concrete icp0 URL line in the exact format https://<frontend-canister-id>.icp0.io, and persist it to a simple text file under frontend/ so it can be copied/pasted without ambiguity."
        },
        {
          "path": "frontend/scripts/print-icp0-url.sh",
          "operation": "create",
          "description": "Create a small helper script that reads the deployed frontend canister id via dfx and prints exactly one URL in the format https://<frontend-canister-id>.icp0.io for easy retrieval after deployment."
        }
      ]
    }
  ]
}