{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Full-screen TikTok-style comments experience with threaded replies, likes, delete, sorting, and dark theme",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the bottom-sheet comments UI with a full-screen overlay comments screen opened from the feed comment button and closed with an explicit control.",
      "acceptanceCriteria": [
        "Tapping the comment icon in the feed opens a full-screen comments view (not a bottom sheet).",
        "The full-screen comments view includes a visible close/back control and returns to the feed when closed.",
        "The feed remains intact behind the comments flow (no route breakage required)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/comments/CommentsSheet.tsx",
          "operation": "modify",
          "description": "Replace the current bottom-sheet implementation with a full-screen overlay implementation (fixed inset container with high z-index) that can be opened/closed via props, includes an explicit close/back control, and leaves the feed mounted behind it."
        },
        {
          "path": "frontend/src/components/feed/FeedItem.tsx",
          "operation": "modify",
          "description": "Keep the existing open/close state wiring from the interaction rail, but ensure it now opens the updated full-screen CommentsSheet overlay and closes cleanly without navigation changes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement TikTok-like full-screen comments layout with header count, independently scrollable list, and sticky safe-area-aware composer.",
      "acceptanceCriteria": [
        "Header shows “Comments” and the current total count for the active feed item.",
        "Comment list is independently scrollable while the composer stays pinned at the bottom.",
        "Layout respects iOS/Android safe areas (no composer hidden behind system UI)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/comments/CommentsSheet.tsx",
          "operation": "modify",
          "description": "Implement the full-screen layout structure: (1) header with “Comments” + count, (2) middle section with its own scrolling for the list, (3) bottom sticky composer area that includes safe-area padding (use existing safe-area utility classes) and remains visible while scrolling."
        },
        {
          "path": "frontend/src/components/comments/CommentComposer.tsx",
          "operation": "modify",
          "description": "Adjust the composer container spacing and safe-area behavior for the new full-screen overlay so the input and send/attach controls remain usable on mobile/PWA with bottom insets; continue supporting optional media attachments via blob-storage ExternalBlob. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add TikTok-like comment interactions: like/unlike, threaded replies, author-only delete, and sort controls (Top/Newest) in the full-screen UI.",
      "acceptanceCriteria": [
        "Each comment row displays actions for Like and Reply; Like shows a count.",
        "Replies are displayed as a thread under the parent comment (visually indented or grouped).",
        "The caller can delete their own comment/reply and the list updates accordingly.",
        "User can switch between at least two sort modes; sort mode clearly indicated in the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/comments/CommentList.tsx",
          "operation": "modify",
          "description": "Evolve the list rendering to support threaded comments (parent with replies) and per-row actions (Like, Reply, Delete). Use the authorization component’s frontend guidance (Internet Identity principal comparison) to decide whether to show Delete for the caller’s own comments/replies. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/comments/CommentsSheet.tsx",
          "operation": "modify",
          "description": "Switch the data source for the full-screen comments overlay from flat comments to threaded comments, add a visible sort mode control (at least Top/Newest) and apply a predictable client-side sort to the threaded structure while keeping the composer sticky."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query mutations/queries needed by the UI interactions (threaded fetch, like toggle behavior, add reply, delete comment, delete reply) and ensure they integrate cleanly with UI state for optimistic updates and/or refetching after actions."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update React Query hooks to use new backend capabilities for replies, comment likes, deletion, and ensure query invalidation keeps counts and lists in sync.",
      "acceptanceCriteria": [
        "New hooks exist for toggling comment likes, adding replies, and deleting comments/replies.",
        "After any mutation, the comments list updates without requiring a full page reload.",
        "The feed item’s displayed comment count stays in sync with the backend/comments query."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement new hooks for: fetching threaded comments, toggling likes on a comment, adding a reply, deleting a comment, deleting a reply; on success, invalidate/refetch the relevant comment queries and also refresh any feed/comment-count dependent state so the feed’s comment count stays synchronized."
        },
        {
          "path": "frontend/src/components/feed/FeedItem.tsx",
          "operation": "modify",
          "description": "Update comment count synchronization so the interaction rail’s comment count reliably reflects the latest threaded comments total after mutations (using invalidation-driven updates rather than placeholder values)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Fix comment count propagation by removing side-effects from useState initializer and updating counts only when comment data changes.",
      "acceptanceCriteria": [
        "No side-effects are performed inside a useState initializer for comment-count updates.",
        "Comment count callback is invoked only when the underlying comments data changes.",
        "No React warnings are introduced by the updated effect logic."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/comments/CommentsSheet.tsx",
          "operation": "modify",
          "description": "Replace the current useState initializer side-effect used for comment count propagation with a useEffect that triggers only when the underlying comments/threaded comments data (and feedItemId) changes, ensuring no React warnings and correct count updates."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Apply a consistent dark TikTok-style theme to the full-screen comments UI with a single non-blue/non-purple accent color and styled loading/error/empty states.",
      "acceptanceCriteria": [
        "Full-screen comments UI uses the same overall dark visual language as the feed/player.",
        "A single non-blue/non-purple accent color is used consistently for highlights/actions.",
        "Loading, error, and empty states are styled and readable on dark backgrounds."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Adjust global theme variables so primary/accent/ring use a single consistent non-blue/non-purple accent color (while keeping the overall dark aesthetic) and ensure components used by the full-screen comments UI inherit the updated theme."
        },
        {
          "path": "frontend/src/components/comments/CommentsSheet.tsx",
          "operation": "modify",
          "description": "Apply consistent dark-mode styling across header, dividers, buttons, and loading/error/empty states within the full-screen comments overlay, using the app’s accent color for interactive highlights (e.g., like, reply, active sort)."
        },
        {
          "path": "frontend/src/components/comments/CommentList.tsx",
          "operation": "modify",
          "description": "Style threaded indentation/grouping, action buttons, and delete affordances to match the dark player aesthetic and use the single accent color consistently for interactive elements."
        }
      ]
    }
  ]
}