{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Optional captions, reliable video upload/editing, and in-feed playback controls",
  "requirements": [
    {
      "id": "REQ-33",
      "summary": "Allow uploads with an empty/whitespace caption while keeping image/video upload flow functional.",
      "acceptanceCriteria": [
        "The Upload button is enabled when a media file is selected even if the caption field is empty/whitespace.",
        "Submitting an upload with an empty caption succeeds and creates a feed item.",
        "User-facing validation/error text no longer says a caption is required."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/feed/UploadDialog.tsx",
          "operation": "modify",
          "description": "Remove caption-required validation and UI disabling logic so uploads proceed when a file is selected even if caption is empty/whitespace; update any user-facing error text to no longer require a caption. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Normalize caption before calling the backend capability (e.g., trim and pass empty string when blank) so the frontend consistently supports optional captions without blocking uploads. (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-35",
      "summary": "Fix the frontend media editing pipeline so video edits remain videos, retain audio, and avoid playback-freezing regressions.",
      "acceptanceCriteria": [
        "Using the in-app editor on a video and then uploading results in a feed item that plays as video (not an image) in the feed.",
        "Uploaded videos retain their original audio track (audio is present when unmuted).",
        "Uploaded videos play through to the end and can be replayed without freezing part-way."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/mediaEdits.ts",
          "operation": "modify",
          "description": "Correct applyVideoEdits to never output an image/jpeg file; ensure it returns a valid video File (typically the original input video file when true non-destructive video editing is not supported) to prevent stripping audio or corrupting playback. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/editor/MediaEditorDialog.tsx",
          "operation": "modify",
          "description": "Adjust the video editing UX so applying edits does not convert videos to images: ensure the Apply action for videos returns the original video File (or only enables edits that can preserve video+audio), and update user-facing messaging in English to set correct expectations. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/feed/UploadDialog.tsx",
          "operation": "modify",
          "description": "Ensure the upload flow uses the edited file returned by the editor without changing MIME type semantics; keep video files as video/* after editing and before upload. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/feed/FeedItem.tsx",
          "operation": "modify",
          "description": "Harden in-feed video playback to reduce freezing risk: manage play/pause lifecycle more carefully for active/inactive transitions, handle ended/replay state, and ensure the rendered element remains a <video> for video media. (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-36",
      "summary": "Add an in-feed pause/resume control for the active video item.",
      "acceptanceCriteria": [
        "When a feed item is a video and is active, a visible Pause/Play control is available on the overlay.",
        "Tapping Pause pauses the active video; tapping Play resumes playback from the current time.",
        "The control does not appear (or is disabled) for image posts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/feed/VideoOverlayControls.tsx",
          "operation": "create",
          "description": "Create an overlay control component that provides Play/Pause UI for the active video item and calls through to a provided video element ref/controller. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/feed/FeedItem.tsx",
          "operation": "modify",
          "description": "Wire the new VideoOverlayControls into the active video overlay (only when isActive && isVideo), and implement the pause/resume behavior by controlling the underlying video element. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/feed/FeedOverlay.tsx",
          "operation": "modify",
          "description": "Ensure overlay layout supports additional active-video controls (Play/Pause) without interfering with existing caption/handle display, and keep controls hidden/disabled for images. (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-37",
      "summary": "Add mute/unmute control for active videos and ensure audio plays when unmuted.",
      "acceptanceCriteria": [
        "Active videos start muted by default, but the user can toggle unmute and hear audio for videos that contain audio.",
        "The mute state change takes effect immediately on the active video element.",
        "The mute/unmute control is accessible in the in-feed overlay UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/feed/VideoOverlayControls.tsx",
          "operation": "modify",
          "description": "Extend the overlay controls to include a Mute/Unmute toggle for active videos (default muted), and expose callbacks/state needed to control the video element muted property immediately. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/feed/FeedItem.tsx",
          "operation": "modify",
          "description": "Implement per-item muted state (default true) for videos and bind it to the <video> element (muted attribute/property) so unmuting outputs audio immediately; pass state/handlers to VideoOverlayControls. (Verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-38",
      "summary": "Ensure the frontend build/deployment flow reflects the fixes and can be re-run successfully.",
      "acceptanceCriteria": [
        "Frontend and backend compile successfully with no build-blocking errors.",
        "The deployed app loads and the upload + playback fixes are available in production."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Update deployment documentation to explicitly call out the required rebuild/redeploy steps after making upload/playback fixes (including cache/service-worker considerations) in English. (Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/scripts/deploy-frontend-prod.sh",
          "operation": "modify",
          "description": "Add/adjust script messaging and/or verification steps as needed to ensure a clean production rebuild and redeploy of the updated frontend assets (dist output). (Verify the component's usage instructions before implementing.)"
        }
      ]
    }
  ]
}